''''''
print("***************欢迎登陆爱尚教育网***************")
print("请输入账号:0001")
print("请输入密码：*****")
print("***********************************************")
''''''
print("***************会员积分管理系统**************")
print("请选择:1 添加,2 删除,3 修改,4 删除,5 退出")
print("***********************************************")
''''''
print("    * ")
print("   ***")
print("  *****")
print(" *******")
print("*********")
print(" *******")
print("  *****")
print("   ***")
print("    * ")
''''''
age=20
name="小明"
print(f"此人姓名为:{name},年龄为:{age}岁")
''''''
a=10 
b=20
print(a+b)
''''''
员工编号=10
员工姓名="lora"
员工年龄=20
员工工资=5000
员工奖金=500
print(f"编号为{员工编号}的员工姓名是{员工姓名},今年{员工年龄}岁，月薪为{员工工资+员工奖金}元")
''''''
c=20
d=30
c,d=d,c
print("c=",c)
print("d=",d)
''''''
num=456
百位=num//100
十位=num%100//10
个位=num%10
print(f"百位是{百位},十位是{十位},个位是{个位}")
''''''
姓名=input("请输入姓名")
年龄=input("请输入年龄")
成绩=input("请输入成绩")
print(f"姓名是{姓名},年龄是{年龄}岁,成绩是{成绩}分")
''''''
e=input("输入一个数字")
f=input("输入另一个数字")
print("两个数字之和是",int(e)+int(f))
print("两个数字之差是",int(e)-int(f))
print("两个数字之积是",int(e)*int(f))
print("两个数字之商是",int(e)/int(f))
''''''
员工编号1=input("请输入第一名员工编号")
基本工资1=input("请输入基本工资")
奖金1=input("请输入奖金")
print(f"{员工编号1}的工资总和为{int(基本工资1)+int(奖金1)}元")
员工编号2=input("请输入第二名员工编号")
基本工资2=input("请输入基本工资")
奖金2=input("请输入奖金")
print(f"{员工编号2}的工资总和为{int(基本工资2)+int(奖金2)}元")
员工编号3=input("请输入第三名员工编号")
基本工资3=input("请输入基本工资")
奖金3=input("请输入奖金")
print(f"{员工编号3}的工资总和为{int(基本工资3)+int(奖金3)}元")
所有工资总额=int(基本工资1)+int(奖金1)+int(基本工资2)+int(奖金2)+int(基本工资3)+int(奖金3)
print(f"三名员工的工资总额为{所有工资总额}元")
''''''
长=int(input("输入长方形的长"))
宽=int(input("输入长方形的宽"))
面积=长*宽
周长=2*(长+宽)
print(f"长方形的面积是{面积},周长是{周长}")
边长=int(input("输入正方形的边长"))
周长=4*边长
面积=边长*边长
print(f"正方形的面积是{面积},周长是{周长}")
r=int(input("输入圆的半径"))
c=2*3.14*r
s=3.14*r*r
print(f"圆的面积是{s},周长是{c}")
import math
a=int(input("输入三角形的边长1"))
b=int(input("输入三角形的边长2"))
c=int(input("输入三角形的边长3"))
d=(a+b+c)/2
周长=a+b+c
面积=math.sqrt(d*(d-a)*(d-b)*(d-c))
print(f"三角形的面积是{面积},周长是{周长}")
''''''
a=input("小红摘的苹果数")
print("小红摘的苹果数是",int(a))
b=input("小刚摘的苹果数")
c=int(a)+int(b)
print("两人一共摘的苹果数是",c)
d=input("小丽摘的苹果数")
e=c+int(d)
print("三人一共摘的苹果数是",e)
f=input("小玉摘的苹果数")
g=e+int(f)
print("四人一共摘的苹果数是",g)
''''''
num=int(input("input a number"))
if 10000<=num<=99999:
    a=num//10000
    b=num%10000//1000
    c=num%1000//100
    d=num%100//10
    e=num%10
    print(f"万位是{a},千位是{b},百位是{c},十位是{d},个位是{e}")
else:
    print("输入错误,请输入一个五位数")
      






      
